ArduPilot/ChibiOS.svn/tools/embsysregviewdata/data/ARM_Cortex-M3/ADI/ADuCM361.xml
			</registers>
		</peripheral>
		<peripheral>
			<name>ADI_T1</name>
			<description>Timer 1</description>
			<groupName>T1</groupName>
			<baseAddress>0x40000400</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>TIMER1</name>
				<value>12</value>
			</interrupt>
			<registers>
				<register>
					<name>T1LD</name>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000010</size>
					<description>16-bit load value</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Load value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>T1VAL</name>
					<addressOffset>0x00000004</addressOffset>
					<size>0x00000010</size>
					<description>16-bit timer value, read only.</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Current value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>T1CON</name>
					<addressOffset>0x00000008</addressOffset>
					<size>0x00000010</size>
					<description>Control Register</description>
					<fields>
						<field>
							<name>EVENTEN</name>
							<description>Enable time capture of an event</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EVENT</name>
							<description>Event Select, selects 1 of the available events.</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>COM</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T0</name>
									<value>1</value>
									<description>- Timer0</description>
								</enumeratedValue>
								<enumeratedValue>
									<name>SPI0</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SPI1</name>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2CS</name>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2CM</name>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DMAERR</name>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DMADONE</name>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXT1</name>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXT2</name>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXT3</name>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWMTRIP</name>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM0</name>
									<value>12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM1</name>
									<value>13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM2</name>
									<value>14</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RLD</name>
							<description>Timer reload on write to clear register</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLK</name>
							<description>Clock Select</description>
							<bitOffset>5</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UCLK</name>
									<value>0</value>
									<description>- System Clock</description>
								</enumeratedValue>
								<enumeratedValue>
									<name>PCLK</name>
									<value>1</value>
									<description>- Peripheral clock</description>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFOSC</name>
									<value>2</value>
									<description>- Internal 32 kHz Oscillator</description>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFXTAL</name>
									<value>3</value>
									<description>- External 32 kHz crystal</description>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ENABLE</name>
							<description>Enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MOD</name>
							<description>Mode</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>FREERUN</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PERIODIC</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UP</name>
							<description>Count-up</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PRE</name>
							<description>Prescaler</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV16</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV256</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV32768</name>
									<value>3</value>
									<description>- If the selected clock source is UCLK then this setting results in a prescaler of 4.</description>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>T1CLRI</name>
					<addressOffset>0x0000000C</addressOffset>
					<size>0x00000010</size>
					<description>Clear interrupt register</description>
					<fields>
						<field>
							<name>CAP</name>
							<description>Clear captured event interrupt</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TMOUT</name>
							<description>Clear timeout interrupt</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>T1CAP</name>
					<addressOffset>0x00000010</addressOffset>
					<size>0x00000010</size>
					<description>Capture Register</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Capture value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>T1STA</name>
					<addressOffset>0x0000001C</addressOffset>
					<size>0x00000010</size>
					<description>Status Register</description>
					<fields>
						<field>
							<name>CLRI</name>
							<description>Value updated in the timer clock domain</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CON</name>
							<description>Ready to receive commands</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAP</name>
							<description>Capture event pending</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TMOUT</name>
							<description>Time out event occurred</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
