ArduPilot/ChibiOS.svn/tools/embsysregviewdata/data/ARM_Cortex-M3/ADI/ADuCM361.xml
			</registers>
		</peripheral>
		<peripheral>
			<name>ADI_PWM</name>
			<description>Pulse Width Modulation</description>
			<groupName>PWM</groupName>
			<baseAddress>0x40001000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x40</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>PWM_TRIP</name>
				<value>35</value>
			</interrupt>
			<interrupt>
				<name>PWM_PAIR0</name>
				<value>36</value>
			</interrupt>
			<interrupt>
				<name>PWM_PAIR1</name>
				<value>37</value>
			</interrupt>
			<interrupt>
				<name>PWM_PAIR2</name>
				<value>38</value>
			</interrupt>
			<registers>
				<register>
					<name>PWMCON0</name>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000010</size>
					<description>PWM Control register</description>
					<fields>
						<field>
							<name>SYNC</name>
							<description>PWM Synchronization</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWM5INV</name>
							<description>Inversion of PWM output</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWM3INV</name>
							<description>Inversion of PWM output</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWM1INV</name>
							<description>Inversion of PWM output</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMIEN</name>
							<description>Enables PWM interrupts</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ENA</name>
							<description>enable PWM outputs</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PRE</name>
							<description>PWM Clock Prescaler</description>
							<bitOffset>6</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>POINV</name>
							<description>Invert all PWM outputs</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HOFF</name>
							<description>High Side Off</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LCOMP</name>
							<description>Load Compare Registers</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIR</name>
							<description>Direction Control</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MOD</name>
							<description>Enables H-Bridge Mode</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ENABLE</name>
							<description>Enables all PWM outputs</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PWMCON1</name>
					<addressOffset>0x00000004</addressOffset>
					<size>0x00000008</size>
					<description>Trip control register</description>
					<fields>
						<field>
							<name>CONVSTART</name>
							<description>Enable adc conversion start from pwm</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TRIPEN</name>
							<description>Enable PWM trip functionality</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CONVSTARTDELAY</name>
							<description>ADC conversion start delay configuration</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>PWMCLRI</name>
					<addressOffset>0x00000008</addressOffset>
					<size>0x00000010</size>
					<description>PWM interrupt clear. Write to this register clears the latched PWM interrupt.</description>
					<fields>
						<field>
							<name>TRIP</name>
							<description>Clear the latched trip interrupt</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWM2</name>
							<description>Clear the latched PWM2 interrupt</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWM1</name>
							<description>Clear the latched PWM1 interrupt</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWM0</name>
							<description>Clear the latched PWM0 interrupt</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PWM0COM0</name>
					<addressOffset>0x00000010</addressOffset>
					<size>0x00000010</size>
					<description>Compare Register 0 for PWM0 and PWM1</description>
				</register>
				<register>
					<name>PWM0COM1</name>
					<addressOffset>0x00000014</addressOffset>
					<size>0x00000010</size>
					<description>Compare Register 1 for PWM0 and PWM1</description>
				</register>
				<register>
					<name>PWM0COM2</name>
					<addressOffset>0x00000018</addressOffset>
					<size>0x00000010</size>
					<description>Compare Register 2 for PWM0 and PWM1</description>
				</register>
				<register>
					<name>PWM0LEN</name>
					<addressOffset>0x0000001C</addressOffset>
					<size>0x00000010</size>
					<description>Period Value register for PWM0 and PWM1</description>
				</register>
				<register>
					<name>PWM1COM0</name>
					<addressOffset>0x00000020</addressOffset>
					<size>0x00000010</size>
					<description>Compare Register 0 for PWM2 and PWM3</description>
				</register>
				<register>
					<name>PWM1COM1</name>
					<addressOffset>0x00000024</addressOffset>
					<size>0x00000010</size>
					<description>Compare Register 1 for PWM2 and PWM3</description>
				</register>
				<register>
					<name>PWM1COM2</name>
					<addressOffset>0x00000028</addressOffset>
					<size>0x00000010</size>
					<description>Compare Register 2 for PWM2 and PWM3</description>
				</register>
				<register>
					<name>PWM1LEN</name>
					<addressOffset>0x0000002C</addressOffset>
					<size>0x00000010</size>
					<description>Period Value register for PWM2 and PWM3</description>
				</register>
				<register>
					<name>PWM2COM0</name>
					<addressOffset>0x00000030</addressOffset>
					<size>0x00000010</size>
					<description>Compare Register 0 for PWM4 and PWM5</description>
				</register>
				<register>
					<name>PWM2COM1</name>
					<addressOffset>0x00000034</addressOffset>
					<size>0x00000010</size>
					<description>Compare Register 1 for PWM4 and PWM5</description>
				</register>
				<register>
					<name>PWM2COM2</name>
					<addressOffset>0x00000038</addressOffset>
					<size>0x00000010</size>
					<description>Compare Register 2 for PWM4 and PWM5</description>
				</register>
				<register>
					<name>PWM2LEN</name>
					<addressOffset>0x0000003C</addressOffset>
					<size>0x00000010</size>
					<description>Period Value register for PWM4 and PWM5</description>
				</register>
