ArduPilot/ChibiOS.svn/tools/embsysregviewdata/data/ARM_Cortex-M3/ADI/ADuCM361.xml
			</registers>
		</peripheral>
		<peripheral>
			<name>ADI_CLKCTL</name>
			<description>Clock Control</description>
			<groupName>CLKCTL</groupName>
			<baseAddress>0x40002000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x448</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CLKCON0</name>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000010</size>
					<description>System clocking architecture control register</description>
					<fields>
						<field>
							<name>CLKOUT</name>
							<description>GPIO output clock multiplexer select bits</description>
							<bitOffset>5</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UCLKCG</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UCLK</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PCLK</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HFOSC</name>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFOSC</name>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFXTAL</name>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKMUX</name>
							<description>Digital subsystem clock source select bits.</description>
							<bitOffset>3</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>HFOSC</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFXTAL</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFOSC</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXTCLK</name>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CD</name>
							<description>Clock divide bits</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV2</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV4</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV8</name>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV16</name>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV32</name>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV64</name>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV128</name>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CLKCON1</name>
					<addressOffset>0x00000004</addressOffset>
					<size>0x00000010</size>
					<description>System Clocks Control Register 1</description>
					<fields>
						<field>
							<name>PWMCD</name>
							<description>Clock divide bits for PWM system clock</description>
							<bitOffset>12</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV2</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV4</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV8</name>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV16</name>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV32</name>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV64</name>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV128</name>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UARTCD</name>
							<description>Clock divide bits for UART system clock</description>
							<bitOffset>9</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV2</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV4</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV8</name>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV16</name>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV32</name>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV64</name>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV128</name>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>I2CCD</name>
							<description>Clock divide bits for I2C system clock</description>
							<bitOffset>6</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV2</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV4</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV8</name>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV16</name>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV32</name>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV64</name>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV128</name>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SPI1CD</name>
							<description>Clock divide bits for SPI1 system clock</description>
							<bitOffset>3</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV2</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV4</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV8</name>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV16</name>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV32</name>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV64</name>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV128</name>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SPI0CD</name>
							<description>Clock divide bits for SPI0 system clock</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV2</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV4</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV8</name>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV16</name>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV32</name>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV64</name>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV128</name>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CLKDIS</name>
					<addressOffset>0x0000002C</addressOffset>
					<size>0x00000010</size>
					<description>System Clocks Control Register 1</description>
					<fields>
						<field>
							<name>DISADCCLK</name>
							<description>Disable ADC system clock</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DISDMACLK</name>
							<description>Disable DMA system clock</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DISDACCLK</name>
							<description>Disable DAC system clock</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIST1CLK</name>
							<description>Disable Timer 1 system clock</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIST0CLK</name>
							<description>Disable Timer 0 system clock</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DISPWMCLK</name>
							<description>Disable PWM system clock</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DISUARTCLK</name>
							<description>Disable UART system clock</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DISI2CCLK</name>
							<description>Disable I2C system clock</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DISSPI1CLK</name>
							<description>Disable SPI1 system clock</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DISSPI0CLK</name>
							<description>Disable SPI0 system clock bits</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>XOSCCON</name>
					<addressOffset>0x00000410</addressOffset>
					<size>0x00000008</size>
					<description>Crystal Oscillator control</description>
					<fields>
						<field>
							<name>DIV2</name>
							<description>Divide by two enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ENABLE</name>
							<description>Crystal oscillator circuit enable (Enable the oscillator circuitry.)</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CLKSYSDIV</name>
					<addressOffset>0x00000444</addressOffset>
					<size>0x00000010</size>
					<description>Sys Clock div2 Register</description>
					<fields>
						<field>
							<name>DIV2EN</name>
							<description>bits</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
